{
  "the_blog": {
    "title": "The blog",
    "long_description": "The blog is a personal blog project developed from scratch with the goal of studying and applying modern web development technologies. The system was built as a fullstack experimentation environment, combining advanced frontend, backend, and database integration practices.\n\nOn the frontend, the project uses React, Next.js, and TailwindCSS to create modern, responsive, and high-performance interfaces. On the backend, it was implemented with TypeScript and Node.js, ensuring static typing and better code organization. The chosen database was SQLite, allowing for simple and efficient integration.\n\nThe main objectives include: building fullstack applications with Next.js, TypeScript, and Node.js; creating responsive interfaces using React and TailwindCSS; integrating the SQLite database; implementing authentication and authorization; developing a complete CRUD for post management; and organizing a scalable architecture.\n\nAmong the functionalities already implemented are: individual page for each post, user login, administration panel for managing posts, public listing with date and author, and a system for creating, editing, and deleting posts (CRUD)."
  },
  "maismix": {
    "title": "MaisMix",
    "long_description": "The MaisMix project was a mobile application developed on demand for the company MaisMix, located in Sertãozinho, which required a practical and efficient solution to manage delivery scheduling and organize registered customers. The proposal arose from a real operational need, where manual control of schedules and registrations caused delays and difficulties in daily management.\n\nI worked as a freelance developer responsible for the entire creation cycle, from the initial idea to the final product delivery. The process began with the complete prototyping of the interface in Figma, ensuring a smooth, intuitive user experience aligned with the company’s visual identity.\n\nFor the technical development, I used Flutter and Dart to build a high-performance, responsive, cross-platform application. The backend was planned and implemented with a focus on direct integration with Firebase, which was used for secure data storage, user authentication, and real-time synchronization of information.\n\nThe system allowed MaisMix to have full control over delivery time scheduling, improving communication with customers and optimizing operational workflow. In addition, the platform included features for centralized customer management, ensuring quick and secure access to each client’s data."
  },
  "portifolio": {
    "title": "Portfolio",
    "long_description": "The Portfolio project is a personal web application developed with the purpose of presenting my professional skills, experiences, and a bit more about myself. This new version was designed to serve as a dynamic, modern, and responsive showcase, highlighting not only my technical expertise but also my journey as a developer.\n\nThe application was built using React, Next.js, TailwindCSS, and HTML, combining modern frontend development practices with a clean and accessible design. The project structure leverages the power of Next.js for server-side rendering and optimized performance, while TailwindCSS ensures a highly customizable and consistent visual style.\n\nOne of the main goals of this portfolio is to provide visitors with an intuitive and engaging navigation experience, where they can explore my projects, learn about the technologies I work with, and understand my professional background in detail. Each project section includes descriptions, technologies used, and links to repositories or case studies, offering a complete view of my work."
  },
  "algvis": {
    "title": "AlgVis",
    "long_description": "AlgVis is an interactive educational platform designed to make learning algorithms and data structures more intuitive through animated visualizations. It allows users to observe in real time the operation of various algorithms, such as Bubble Sort and Quick Sort, as well as generate random arrays, control execution speed, and access step-by-step explanations.\n\nThe frontend was built with React, Next.js, TypeScript, TailwindCSS, and Framer Motion, ensuring a modern, responsive design with smooth animations. The backend uses Python and FastAPI, providing a fast and scalable foundation for running and integrating algorithms.\n\nThe project organizes algorithms into different categories and keeps the implementations in a separate repository, allowing for easy maintenance and expansion."
  },
  "trees_everywhere": {
    "title": "Trees Everywhere",
    "long_description": "Trees Everywhere is a project developed as part of a challenge for a junior backend developer position, aimed at maintaining a database of trees planted by volunteers around the world. Users can be linked to one or more accounts, allowing them to view trees planted by the group of users in the same account.\n\nImplemented features include: admin pages for registering and managing users, accounts, and plants; detailed views of species and planted trees; authentication and permission controls ensuring that each user can only see their own trees or those of the accounts they belong to; and the ability to add newly planted trees.\n\nThe system provides a REST API documented with Swagger, enabling data consumption in JSON format. Automated tests validate business rules and views, including access control scenarios and methods for linking trees to users.\n\nThe interface was styled with Tailwind CSS to ensure a clean, responsive, and modern design."
  },
  "portfolio_old": {
    "title": "First Portfolio",
    "long_description": "An Angular project developed to showcase professional information, experiences, skills, and personal projects in an organized and responsive way.\n\nThe main goal is to serve as a personal portfolio, displaying sections such as About Me, professional experiences, projects, and contact.\n\nTechnologies used include Angular 19, TypeScript, HTML5, and Tailwind CSS, ensuring a modern and responsive design."
  }
}
