{
  "the_blog": {
    "title": "The blog",
    "long_description": "The blog is a personal blog project developed from scratch with the goal of studying and applying modern web development technologies. The system was built as a fullstack experimentation environment, combining advanced frontend, backend, and database integration practices.\n\nOn the frontend, the project uses React, Next.js, and TailwindCSS to create modern, responsive, and high-performance interfaces. On the backend, it was implemented with TypeScript and Node.js, ensuring static typing and better code organization. The chosen database was SQLite, allowing for simple and efficient integration.\n\nThe main objectives include: building fullstack applications with Next.js, TypeScript, and Node.js; creating responsive interfaces using React and TailwindCSS; integrating the SQLite database; implementing authentication and authorization; developing a complete CRUD for post management; and organizing a scalable architecture.\n\nAmong the functionalities already implemented are: individual page for each post, user login, administration panel for managing posts, public listing with date and author, and a system for creating, editing, and deleting posts (CRUD)."
  },
  "maismix": {
    "title": "MaisMix",
    "long_description": "The MaisMix project was a mobile application developed on demand for the company MaisMix, located in Sertãozinho, which required a practical and efficient solution to manage delivery scheduling and organize registered customers. The proposal arose from a real operational need, where manual control of schedules and registrations caused delays and difficulties in daily management.\n\nI worked as a freelance developer responsible for the entire creation cycle, from the initial idea to the final product delivery. The process began with the complete prototyping of the interface in Figma, ensuring a smooth, intuitive user experience aligned with the company’s visual identity.\n\nFor the technical development, I used Flutter and Dart to build a high-performance, responsive, cross-platform application. The backend was planned and implemented with a focus on direct integration with Firebase, which was used for secure data storage, user authentication, and real-time synchronization of information.\n\nThe system allowed MaisMix to have full control over delivery time scheduling, improving communication with customers and optimizing operational workflow. In addition, the platform included features for centralized customer management, ensuring quick and secure access to each client’s data."
  }
}
