{
  "the_blog": {
    "title": "The blog",
    "long_description": "The blog é um projeto de blog pessoal desenvolvido do zero com o objetivo de estudar e aplicar tecnologias modernas de desenvolvimento web. O sistema foi construído como um ambiente de experimentação fullstack, combinando práticas avançadas de frontend, backend e integração com banco de dados.\n\nNo frontend, o projeto utiliza React, Next.js e TailwindCSS para criar interfaces modernas, responsivas e de alto desempenho. No backend, foi implementado com TypeScript e Node.js, garantindo tipagem estática e melhor organização do código. O banco de dados escolhido foi o SQLite, permitindo uma integração simples e eficiente.\n\nOs objetivos principais incluem: construção de aplicações fullstack com Next.js, TypeScript e Node.js; criação de interfaces responsivas utilizando React e TailwindCSS; integração de banco de dados SQLite; implementação de autenticação e autorização; desenvolvimento de um CRUD completo para gerenciamento de posts; e organização de uma arquitetura escalável.\n\nEntre as funcionalidades já implementadas estão: página individual para cada post, login de usuário, painel de administração para gerenciamento de posts, listagem pública com data e autor, e sistema de criação, edição e exclusão de posts (CRUD)."
  },
  "maismix": {
    "title": "MaisMix",
    "long_description": "O projeto MaisMix foi uma aplicação móvel desenvolvida sob demanda para a empresa MaisMix, localizada em Sertãozinho, que necessitava de uma solução prática e eficiente para gerenciar o agendamento de entregas e a organização dos clientes cadastrados. A proposta surgiu a partir de uma necessidade real da operação, onde o controle manual dos horários e cadastros gerava atrasos e dificuldades na gestão diária.\n\nAtuei como desenvolvedor freelancer responsável por todo o ciclo de criação, desde a concepção da ideia até a entrega final do produto. O processo iniciou-se com a prototipação completa da interface no Figma, garantindo uma experiência de usuário fluida, intuitiva e alinhada à identidade visual da empresa.\n\nNo desenvolvimento técnico, utilizei Flutter e Dart para criar um aplicativo multiplataforma de alto desempenho e com design responsivo. O back-end foi planejado e implementado com foco em integração direta ao Firebase, que foi utilizado para armazenamento seguro dos dados, autenticação de usuários e sincronização em tempo real das informações.\n\nO sistema permitiu que a MaisMix tivesse total controle sobre o agendamento dos horários de entrega, facilitando a comunicação com clientes e otimizando o fluxo operacional. Além disso, a plataforma incluiu funcionalidades para o gerenciamento centralizado dos cadastros, garantindo acesso rápido e seguro aos dados de cada cliente."
  },
  "portifolio": {
    "title": "Portfólio",
    "long_description": "O projeto Portfólio é uma aplicação web pessoal desenvolvida com o objetivo de apresentar minhas habilidades profissionais, experiências e contar um pouco mais sobre mim. Esta nova versão foi planejada para ser um portfólio dinâmico, moderno e responsivo, destacando não apenas minhas competências técnicas, mas também minha trajetória como desenvolvedor.\n\nA aplicação foi construída utilizando React, Next.js, TailwindCSS e HTML, combinando práticas modernas de desenvolvimento frontend com um design limpo e acessível. A estrutura do projeto aproveita os recursos do Next.js para renderização no lado do servidor e desempenho otimizado, enquanto o TailwindCSS garante um estilo visual consistente e altamente personalizável.\n\nUm dos principais objetivos deste portfólio é oferecer aos visitantes uma experiência de navegação intuitiva e envolvente, onde seja possível explorar meus projetos, conhecer as tecnologias com as quais trabalho e entender em detalhes meu histórico profissional. Cada seção de projeto inclui descrições, tecnologias utilizadas e links para repositórios ou estudos de caso, oferecendo uma visão completa do meu trabalho."
  },
  "algvis": {
    "title": "AlgVis",
    "long_description": "O AlgVis é uma plataforma educacional interativa desenvolvida para tornar o aprendizado de algoritmos e estruturas de dados mais intuitivo por meio de visualizações animadas. Com ele, é possível acompanhar em tempo real o funcionamento de diversos algoritmos, como Bubble Sort e Quick Sort, além de gerar arrays aleatórios, controlar a velocidade de execução e acessar explicações passo a passo.\n\nO frontend foi construído com React, Next.js, TypeScript, TailwindCSS e Framer Motion, garantindo um design moderno, responsivo e com animações fluidas. O backend utiliza Python e FastAPI, fornecendo uma base rápida e escalável para execução e integração dos algoritmos.\n\nO projeto organiza os algoritmos em diferentes categorias e mantém as implementações em um repositório separado, permitindo fácil manutenção e expansão."
  },
  "trees_everywhere": {
    "title": "Trees Everywhere",
    "long_description": "O Trees Everywhere é um projeto desenvolvido como desafio para uma vaga de desenvolvedor backend júnior, com o objetivo de manter um banco de dados de árvores plantadas por voluntários ao redor do mundo. Usuários podem estar associados a uma ou mais contas, visualizando as árvores plantadas pelo grupo de usuários da mesma conta.\n\nEntre as funcionalidades implementadas estão: páginas de administração para cadastro e gerenciamento de usuários, contas e plantas; visualização detalhada de espécies e árvores plantadas; autenticação e controle de permissões para garantir que cada usuário veja apenas suas próprias árvores ou as das contas das quais participa; e adição de novas árvores plantadas.\n\nO sistema conta com uma API REST documentada com Swagger, permitindo o consumo dos dados em formato JSON. Testes automatizados validam o correto funcionamento das regras de negócio e das views, incluindo cenários de controle de acesso e métodos para associar árvores a usuários.\n\nA interface foi estilizada com Tailwind CSS para garantir um design limpo, responsivo e moderno."
  },
  "first_portifolio": {
    "title": "Primeiro portfólio",
    "long_description": "Projeto em Angular desenvolvido para apresentar informações profissionais, experiências, habilidades e projetos pessoais de forma organizada e responsiva.\n\nO objetivo principal é servir como portfólio pessoal, exibindo seções como informações sobre mim, experiências profissionais, projetos e contato.\n\nAs tecnologias utilizadas incluem Angular 19, TypeScript, HTML5 e Tailwind CSS, garantindo um design moderno e responsivo."
  }
}
