{
  "the_blog": {
    "title": "The blog",
    "long_description": "The blog é um projeto de blog pessoal desenvolvido do zero com o objetivo de estudar e aplicar tecnologias modernas de desenvolvimento web. O sistema foi construído como um ambiente de experimentação fullstack, combinando práticas avançadas de frontend, backend e integração com banco de dados.\n\nNo frontend, o projeto utiliza React, Next.js e TailwindCSS para criar interfaces modernas, responsivas e de alto desempenho. No backend, foi implementado com TypeScript e Node.js, garantindo tipagem estática e melhor organização do código. O banco de dados escolhido foi o SQLite, permitindo uma integração simples e eficiente.\n\nOs objetivos principais incluem: construção de aplicações fullstack com Next.js, TypeScript e Node.js; criação de interfaces responsivas utilizando React e TailwindCSS; integração de banco de dados SQLite; implementação de autenticação e autorização; desenvolvimento de um CRUD completo para gerenciamento de posts; e organização de uma arquitetura escalável.\n\nEntre as funcionalidades já implementadas estão: página individual para cada post, login de usuário, painel de administração para gerenciamento de posts, listagem pública com data e autor, e sistema de criação, edição e exclusão de posts (CRUD)."
  },
  "maismix": {
    "title": "MaisMix",
    "long_description": "O projeto MaisMix foi uma aplicação móvel desenvolvida sob demanda para a empresa MaisMix, localizada em Sertãozinho, que necessitava de uma solução prática e eficiente para gerenciar o agendamento de entregas e a organização dos clientes cadastrados. A proposta surgiu a partir de uma necessidade real da operação, onde o controle manual dos horários e cadastros gerava atrasos e dificuldades na gestão diária.\n\nAtuei como desenvolvedor freelancer responsável por todo o ciclo de criação, desde a concepção da ideia até a entrega final do produto. O processo iniciou-se com a prototipação completa da interface no Figma, garantindo uma experiência de usuário fluida, intuitiva e alinhada à identidade visual da empresa.\n\nNo desenvolvimento técnico, utilizei Flutter e Dart para criar um aplicativo multiplataforma de alto desempenho e com design responsivo. O back-end foi planejado e implementado com foco em integração direta ao Firebase, que foi utilizado para armazenamento seguro dos dados, autenticação de usuários e sincronização em tempo real das informações.\n\nO sistema permitiu que a MaisMix tivesse total controle sobre o agendamento dos horários de entrega, facilitando a comunicação com clientes e otimizando o fluxo operacional. Além disso, a plataforma incluiu funcionalidades para o gerenciamento centralizado dos cadastros, garantindo acesso rápido e seguro aos dados de cada cliente."
  }
}
